{
  "main": {
    "name":"Carlos Lopez",
    "occupation":"Educator & Web Developer",
    "description":"I design and program websites and web applications of all types. I also hope to share my web dev experiences while helping others on their coding journey",
    "image":"clo-hs-comic-pinkBG.jpg",
    "bio": "I am an accomplished educator with full stack web developer expertise and a passion for creating and lifelong learning.  I thoroughly enjoy the problem solving process while making and breaking apps across the entire stack spectrum. I tend to gravitate towards front end development but love being kept on my toes with backend data challenges and solutions.  Ultimately, I’m just addicted to the excitement and magic of making fully functional, useful, and engaging apps for the web.  Although my version control experience is with Git, I am comfortable adapting to varied team's’ needs and environments. My background in world languages and language acquisition concepts truly help me understand and respect the process of learning multiple languages and cultures. Combine that with my bootcamp experience at UT Austin, which absolutely required fast paced technical  proficiency growth for success, and I feel well positioned technically and mentally to grow with demands and industry.",
    "email": "clo2go@gmail.com",
    "phone": "",
    "address":{
      "street":"",
      "city":"Austin",
      "state":"TX",
      "zip": "78704"
    },
    "website": "www.clo2goco@gmail.com",
    "resumedownload":"https://drive.google.com/file/d/0B7JDUO3yBcWpYjBYT2VnbXpzd3c/view?usp=sharing",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/clo2go",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"https://twitter.com/clo2go",
        "className":"fa fa-twitter"
      },
      {
        "name":"google-plus",
        "url":"https://plus.google.com/u/0/105099422234188892292",
        "className":"fa fa-google-plus"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/carlos-lopez-clo2go",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://instagram.com/clo2go/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/clo2go",
        "className":"fa fa-github"
      },
      {
        "name":"stackoverflow",
        "url":"https://stackoverflow.com/users/6657094/carlos-lopez",
        "className":"fa fa-stack-overflow"
      }
    ]
  },

  "resume":{
    "education":[
      {
        "school":"The UT Coding Bootcamp at UT Austin",
        "degree":"Full Stack Web Development Certificate.",
        "graduated":"February 2016",
        "description":"The Coding Bootcamp at UT Austin is an intensive 24-week course in which I learned about and put into practice various web technologies from different parts of the MERN Stack: MongoDB, Express.js, React.js, & Node.js. In those rigorous 24 weeks, JavaScript, JQuery, HTML5/CSS3, Responsive Design, Git, API/JSON, Bootstrap, React.js, Node.js, MongoDB, PHP, Laravel, RESTful API, Firebase, MySQL, Heroku, Security and Session Storage, and User Authentication were also utilized and deployed in a variety of projects and web applications"
      },
      {
        "school":"Concordia University- Portland",
        "degree":"Master of Education: Curriculum & Instruction with an E-Learning/ Tech Education Specialization.",
        "graduated":"December 2015",
        "description":"Studied the effects of instructional technology in all environments (distance, face to face, synchronous, asynchronous), with all populations, while researching data-backed best practices for program and instructional design and implementation."
      },
      {
        "school":"Wayland Baptist University",
        "degree":"Bachelor of Business Administration: Information Systems Specialization. Spanish Double Major",
        "graduated":"Aug 2004",
        "description":"2-year NAIA varsity athlete for WBU Pioneers – Pitcher. Student Government: Senior Senator. Represented Wayland Baptist University to lobby for Texas Equalization Grant at the Capitol in Austin, Texas. Freshman orientation team leader. Volunteer big brother for underprivileged students in Plainview community schools. Member of “Team Wayland” community service activity group."

      }
    ],
    "work":[
      {
        "company":"LBJ Early College High School- Austin Independent School District",
        "title":"Spanish Teacher ",
        "years":"Sept 2005 - Present",
        "description":"I facilitate Spanish language acquisition at LBJ Early College High School.  I instruct all levels including AP Spanish Language and Literature.  I am currently our Campus Innovation Coach, Professional Pathways for Teachers (PPfT) Teacher Liason, and Lead Teacher for after school Twilight tutoring / credit recovery program. I have also been the Varsity Assistant Baseball Coach for 5 years, Sponsor of the Cambio Club, recipient of the Martha Quiat travel stipend, and awarded Teacher of Promise."
      },
      {
        "company":"OnAirstreaming",
        "title":"Production Assistant",
        "years":"March 2010 - Present",
        "description":"As a member of our small group I wore many and all hats required to make our unique recordings and live events special. Duties included various social media campaigns, coordinating live events, working with labels, artists, brands, and sponsors to ensure logistics, hospitality, security, and promotional needs were always met to consistently recreate a magical experience for all of our guests and viewers online."
      }
    ],
    "skills":[
      {
        "name":"HTML5",
        "url":"https://www.facebook.com/clo2go",
        "className":" fa fa-border fa-html5 fa-5x"
      },
      {
        "name":"CSS3",
        "url":"https://www.facebook.com/clo2go",
        "className":"fa fa-border fa-css3 fa-5x"
      },
      {
        "name":"Vanilla JS",
        "url":"https://www.facebook.com/clo2go",
        "className":"fa fa-border fa-code fa-5x"
      },
      {
        "name":"Node.js",
        "url":"https://www.facebook.com/clo2go",
        "className":"fa fa-border fa-exchange fa-5x"
      },
      {
        "name":"Firebase",
        "url":"https://www.facebook.com/clo2go",
        "className":"fa fa-border fa-database fa-5x"
      },
      {
        "name":"Express",
        "url":"https://www.facebook.com/clo2go",
        "className":"fa fa-border fa-cogs fa-5x"
      },
      {
        "name":"MongoDB",
        "url":"https://www.facebook.com/clo2go",
        "className":"fa fa-border fa-database fa-5x"
      },
      {
        "name":"Git",
        "url":"https://www.facebook.com/clo2go",
        "className":"fa fa-border fa-github fa-5x"
      },
      {
        "name":"JQuery",
        "url":"https://www.facebook.com/clo2go",
        "className":"fa fa-border fa-code fa-5x"
      },
      {
        "name":"MySql",
        "url":"https://www.facebook.com/clo2go",
        "className":"fa fa-border fa-table fa-5x"
      },
      {
        "name":"React.js",
        "url":"https://www.facebook.com/clo2go",
        "className":"fa fa-border fa-cubes fa-5x"
      },
      {
        "name":"Responsive Design",
        "url":"https://www.facebook.com/clo2go",
        "className":"fa fa-border fa-compress fa-5x"
      }
    ]
  },

  "portfolio":{
    "projects": [
      {
        "title":"Cheevr",
        "description":"An application created in a team of three developers that utilizes Amazon Alexa’s voice recognition and AWS to allow users to create oral review flashcards and quizzes utilizing HTML 5, CSS3, and Google Material design to style the front end and Implemented combinations of Javascript and JQuery, Node, MySQL , AWS Oauth, and Amazon Alexa API to put together backend.",
        "category":"Full Stack Web App",
        "tags":"Web Design",
        "image":"cheevr.png",
        "url":"http://alexaquiz.herokuapp.com/",
        "modal":"#modal-01"
      },
      {
        "title":"French.Press.Play",
        "description":"Group Project with 3 other developers: A dynamic web page that was created in a team of three developers to help walk the user through the process of making coffee in a French Press and help them stay focused while providing activities. Built using HTML5, CSS3, and Bootsrap to style and Javascript for logic along with Giphy, YouTube, and Google Maps API.",
        "category":"Javascript Web Site",
        "tags":"Web Development, HTML5, CSS3, Javascript, ",
        "image":"french-press-play.png",
        "url":"https://french-create-play.herokuapp.com",
        "modal":"#modal-02"
      },
      {
        "title":"GiphyLube",
        "description":"Using GIPHY API to make a dynamic web page that populates with gifs. To finish this task. GIPHY API calls and HTML made with JavaScript and jQuery",
        "category":"Javasccript website",
        "tags":"Web Programming",
        "image":"giphy.png",
        "url":"https://giffy-lube.herokuapp.com/",
        "modal":"#modal-03"
      },
      {
        "title":"Friend Finder",
        "description":"A full-stack web app, Compatibility-based \"FriendFinder\" site that will take in users' results from surveys and compare their answers with those from other users. The app will then display the name and picture of the user with the best overall match. This javascript app runs on Express to handle routing.",
        "category":"Web Development",
        "tags":"Full Stack Web App",
        "image":"friend-finder.png",
        "url":"https://friend-adult-finder.herokuapp.com/",
        "modal":"#modal-04"
      },
      {
        "title":"Eat Da Burger",
        "description":"A burger logger with MySQL, Node, Express, Handlebars, and ORM following model-view-controller (MVC) design pattern. Uses Node and MySQL to query and route data while Handlebars generates HTML.",
        "category":"Full stack web app.",
        "tags":"Web Design",
        "image":"eat-da-burger.png",
        "url":"https://burger-inventory.herokuapp.com/burgers",
        "modal":"#modal-05"
      },
      {
        "title":"Psychic Game",
        "description":"Psychic html game using javscript and Google's Material Design",
        "category":"Javascript website",
        "tags":"Web Dev",
        "image":"psychic.png",
        "url":"https://psychic-material.herokuapp.com/",
        "modal":"#modal-06"
      },
      {
        "title":"Pepe Redux: The Frog that once was.",
        "description":"Pepe was once an innocent cartoon character. This quiz revisits his origins Trivia game built with JavaScript for the logic and jQuery to manipulate HTML.",
        "category":"Javascript website",
        "tags":"html5, css3, ",
        "image":"pepe.png",
        "url":"https://trivia-pepe.herokuapp.com/",
        "modal":"#modal-07"
      },
      {
        "title":"Train Station",
        "description":"A train schedule app that incorporates Firebase to host arrival and departure data. Moment.js retrieves and manipulates time to provide up-to-date information about arrival times and how many minutes remain until various trains arrive at their station",
        "category":"Full Stack Web app",
        "tags":"html5, css3, momentsJS, Bootsrap",
        "image":"train-time.png",
        "url":"https://dat-train-time.herokuapp.com/",
        "modal":"#modal-08"
      }
    ]
  },

  "testimonials":{
    "testimonials":[
      {
        "text":"This guy puts the third plus in C+++",
        "user":"Charlie"
      },
      {
        "text":"This guy codes like a reverse mullet.  Party up front and all business in the back! Heyo!",
        "user":"Chuck"
      }
    ]
  }

}
